// Домашняя работа по Cеминару 1

// Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*
Console.Write("Input a first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());
if(num1 < num2)
{  
    Console.WriteLine($"Max number: {num2}, Min number: {num1}.");
}
else 
{
    Console.WriteLine($"Max number: {num1}, Min number: {num2}");
}
*/
// Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/*
Console.Write("Input a first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a third number: ");
int num3 = Convert.ToInt32(Console.ReadLine());
int max = num1;
if(num2 > max) 
{
     max = num2;
}
else
{ 
    max = num1;
}
if(num3 > max)
{
    max = num3;
    Console.WriteLine($"Max number: {max}");
} 
else  
{
    Console.WriteLine($"Max number: {max}");
}
*/
// Задача 3: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным ( делится ли оно на два без остатка ).

/*
Console.Write("Input a number: ");
int num = Convert.ToInt32(Console.ReadLine());
if(num % 2 == 0)
{
     Console.WriteLine("An even number");
}
else
{
     Console.WriteLine("An not even number");
}
*/
