// Домашняя работа по Cеминару 1

// Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*
Console.Write("Input a first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());
if(num1 < num2)
{  
    Console.WriteLine($"Max number: {num2}, Min number: {num1}.");
}
else 
{
    Console.WriteLine($"Max number: {num1}, Min number: {num2}");
}
*/