// Задача 41: Пользователь вводит с клавиатуры M чисел. 
// Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223 -> 3

/*
int GetAmountPositiveNumber(int howManyNumbers)
{
    int result = 0;
    for(int count = 0; count < howManyNumbers; count++)
    {
        Console.Write("Пожалуйста, введите число: ");
        if(Convert.ToInt32(Console.ReadLine()) > 0) result++;
    }
    return result;
}
Console.WriteLine("Данная программа подсчитывает количество положительных чисел.");
Console.Write("Пожалуйста, укажите сколько чисел вы собираетесь ввести: ");
int howManyNumbers = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Количество положительных чисел: {GetAmountPositiveNumber(howManyNumbers)}.");

*/

